giesekus/OpenFOAM/Oldroyd-BLog/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    inlet
    {
        type            patch;
        nFaces          151;
        startFace       23720;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          90;
        startFace       23871;
    }
    wall_vorttop
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          66;
        startFace       23961;
    }
    wall_liptop
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          53;
        startFace       24027;
    }
    wall_lipdown
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          53;
        startFace       24080;
    }
    wall_vortdown
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          66;
        startFace       24133;
    }
    outlet
    {
        type            patch;
        nFaces          45;
        startFace       24199;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          23982;
        startFace       24244;
    }
)

// ************************************************************************* //
